fe40/tutorials/rheoEFoam/EKI/Ohmic/0/sigma.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 -3 3 0 0 2 0];

internalField   uniform .4;

boundaryField
{
    inletNorth
    {
	type            fixedValue;
	value           uniform .4;
    }
    
    inletSouth
    {
	type            fixedValue;
	value           uniform .4;
    }
    
    inletWest
    {
	type            fixedValue;
	value           uniform 4;
    }
   
    "(walls|frontAndBack)"
    {
	type            zeroGradient;       
    }

    outlet
    {
	type            zeroGradient;         
    }     
}

// ************************************************************************* //
