fe40/tutorials/rheoEFoam/EKI/Ohmic/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue C 0
    volScalarFieldValue sigma .4
);

regions
(
    boxToCell
    {
        box (-0.001 -25e-6 -1e-6) (-25e-6 25e-6 50e-6);
        fieldValues
        (
            volScalarFieldValue C 1
            volScalarFieldValue sigma 4
        ); 
    }
);

// ************************************************************************* //
